public class Main {
    /**
     *
     * Привет! Ты мой новый ревьюер, так что знакомлюсь с тобой через комментарии.
     * Обычно я в эти дни недели закрываю задачу, но сейчас немного не успеваю,
     * сделал только часть того, что требуется.
     *
     * Чтобы не терять время отправляю на проверку только часть с тестами,
     * за остальную часть сяду не раньше воскресения, но уже буду знать после проверки,
     * какие правки если что нужно внести в тесты.
     */
    public static void main(String[] args) {

    }
}
